from sympy import *
import time   #  შემოგვყავს ტაიმერი რათა დავითვალოთ გამოთვლაზე დახარჯული დრო
start = time.time()

# ინტერნეტში მოძიებული ფორმულის თანახმად a_n = a_1 + (n – 1)d   გარკვეული მიმდევრობის შემდეგი მე-n წევრი ტოლია, პირველ წევრს დამატებული (n-1) გამრაველბული რიხცვებს შორის სხვაობზე

difference = 3330   # ამოცანის პირობიდან გამომდინარე ყველა მომდევნო რიცხვს შორის განსხვავება იყო 3330

primes = list(primerange(1488, 10000))  # ყველა რიცხვის თავიდან აცილების მიზნით ვქმნით სიმრავლეს რომელიშიც შედის ყველა 4-ნიშნა prime რიცხვი 
# ქვედა ზღვარი 1488 იმიტომაა რომ პირველი შემთხვევა გამოვრიცხოთ (ის შემთვევა რომელიც ამოცანაშია მოყვანილი)


for number in primes:       # სათითაოდ ვიღებთ ყველა prime წევრს 
    list = []    # ცქმნით დროებით შემნახველ ლისთს სადაც შევინახავთ სავარაუდო პასუხებს
    
    for i in range(1,4):

        arithmetic_sequence_n_th = number + (i-1)*difference     # პირველი წევრის მეშვეობით ვითვლით დანარჩენ 2 წევრს

        if isprime(arithmetic_sequence_n_th):   # თუ დანარჩენი 2 წევრიც prime-ია მაშინ ვამატებთ შემნახველ ლისთში
            list.append(arithmetic_sequence_n_th)
    
    
    if len(list) == 3 and set(str(list[0])) == set(str(list[1])) == set(str(list[2])):  # თუ შემნახველი ლისთის ყველა წევრი შეიცავს ერთი და იგივე ციფრებს მაშინ პასუხი მიგვიღია
        print((str(list[0])) + (str(list[1])) + (str(list[2])))
        break   # კოდს ვწყვეტთ პირველივე ასეთი წევრების ნავისთანავე


print("Calculation time:" , time.time() -start)     # ვპრინტავთ გამოთვალზე დახარჯულ დროს
