import time   #  შემოგვყავს ტაიმერი რათა დავითვალოთ გამოთვლაზე დახარჯული დრო
start = time.time()


prime_factors = []     # ვინახავთ ძირითად მარტივ გამყოფებს 

number = 600851475143    # რიცხვი რომლის მარტივი გამყოფებიც გვაინტერესებს
Number = int(number)     # რიცხვი რომლის მარტივი გამყოფებიც გვაინტერესებს  
                         # ორი იმიტოა რომ ერთი გაყოფის შემდეგ ათწილადის სახით იწერება და for-ციხლში ვეღარ ვიყენებ
while True:
    for i in range (2,Number):    # 2-დან თვითონ ამ რიცხვამდე ვიძახებთ ყველა რიცხვს
        if number % i == 0 :        # ვნახულობთ რომელიმე გამოძახებული რიხცვი ხომ არ არის მარტივი გამყოფი
            prime_factors.append(i) # თუ რომელიმე გამოძახებული რიცხვი მარტივი გამოყოფია მას ვამატებთ სიაში
            number = number / i     # სიაში დამატების შემდეგ მთავარ რიცხვს ვყობთ მის მარტივ გამყოფზე.
            break                   # და ვინახავთ თავის თავში რათა ციკლის გამეორების შემდეგ ვიპოვოთ ახალი მატივი გამყოფი
        
    if number == 1 :    # მოცემული რიცხვის მარტივი გამოყოფებზე გაყოფის შემდეგ ის გაუტოლდა 1-ს მაშინ ციხლი მთავრდება რადგან ნაპოვნია ყველა მარტივი გამყოფი
        break

print( "largest prime factor is: " + str(max(prime_factors)))  # მარტივი გამყოფებიდან ვირჩევთ უდიდესს

print("Calculation time:" , time.time() -start)     # ვპრინტავთ გამოთვალზე დახარჯულ დროს