import time   #  შემოგვყავს ტაიმერი რათა დავითვალოთ გამოთვლაზე დახარჯული დრო
start = time.time()


sum = 0     # ვქმნით ცკლადს რომელშიც შევკრიბავთ ყველა ხარისხის ჯამს

for i in range(1,1001):
    sum += i**i     # აგვყვს ხარისხში და ვამატებთ ჯამს

number = str(sum)       # რიცხვი გადაგვყავს სტრინგებში
last_10_number = len(number) - 10   # ვქმნით ცვლადს რომელიც დაგვეხმარება ბოლო 10 ციფრის ჩვენებაში
print(number[last_10_number:])      # ტერმინალში გამოგვყავს ბოლო 10 ციფრი



print("Calculation time:" , time.time() -start)     # ვპრინტავთ გამოთვალზე დახარჯულ დროს
