import math  # შემოგყვავს მატემატიკის ბიბლიოთეკა
import time   #  შემოგვყავს ტაიმერი რათა დავითვალოთ გამოთვლაზე დახარჯული დრო
start = time.time()


counter = 0

for n in range(1,101):  # შემოგვყავს პირველი for ციკლი რათა შევქმნათ n-ცვლადი
    for r in range(1,n):    # შემოგვყავს მეორე for ციკლი რათა შევქმნათ r-ცვლადი  

        if (math.comb(n, r)) > 10**6: # როცა ვიპოვით პირველ ისეთ n, r კომბინაციას რომლის კომბინაციების ჯამი მეტი იქნება მილიონზე ვასრულებთ შემდეგ ლოგიკას
            insider = n - 2*r + 1       # ვიყენებთ კომბინატორიკის შემდეგ თვისებას:  10C2 == 10C8   შესაბამისად როცა გვექნება პირველი წევრი მარტივად შეგვიძლია გავიგოთ ბოლოც და შესაბამისად იმ წევრების რაოდენობაც რომლებიც მათ შორისაა
            counter += insider      # იმ შემდეგ რაც გავიგებთ რამდენი წევრი აკმაყოფილებს მოთხოვნას, მათ რაოდენობას ვამატებთ მთვლელს
            break   # ვწყვითავთ r-ულ ციკლს რათა გადავიდეთ შემდეგი n-ის შემოწმებაზე 


print(counter)
print("Calculation time:" , time.time() -start)     # ვპრინტავთ გამოთვალზე დახარჯულ დროს





""" 
# მოცემული კოდიც იგივე შინაარსისა უბრალოდ აქ არ ვიყენებთ კომბინატორიკის ზემოთ აღნიშნულ თვისებას რის გამოც კოდი დაახლოებით 15-ჯერ უფრო ნელია

counter = 0
for n in range(1,101):
    for r in range(1,n):    

        if (math.comb(n, r)) > 10**6:
            counter +=1

print(counter)

"""