from sympy import *
import math
import time   #  შემოგვყავს ტაიმერი რათა დავითვალოთ გამოთვლაზე დახარჯული დრო
start = time.time()


# საწყისი რიცხვი
number = 3

# prime რიცხვების სიმრავლე
primes = [2]



while True:
    if isprime(number):   # თუ რიცხვი prime-ია მაშინ დავამატოთ ლისთში
        primes.append(number)
    else:       # თუ არ არის prime, მაშინ გავარკვიოთ ჩაიწერება თუ არა ის მოცემული ფორმულით
        for i in primes:    
            if math.sqrt(((number-i)/2)) == int(math.sqrt(((number-i)/2))):   # თუ ეს რიცხვი წარმოიდგინება ამოცანაში მოცემული ფორმილი ანუ, კვადრატში ასაყვანი რიცხვი ზუსტად ემთხვევა მის სრულ მნიშვნელობა (დამრგვარებულ მნიშვნელობას)
                break   # ვწყვიტავთ for ციკლს
        else:
            print (number)  # და თუ კვადრატში ასაყვანი რიცხვი არ უდრის მის სრულ მნიშნველობას მაშინ ეს იქნება ის რიცხვი რომელიც აბათილებს თეორემას
            break # ვწყვიტავთ while ციკლს

    number += 2 # ყოველ მომდევნო რიცხვს ვზრდით 2-ით რათა თავიდან ავირიდოთ კენტი რიცხვების ჩაწერა

print("Calculation time:" , time.time() -start)     # ვპრინტავთ გამოთვალზე დახარჯულ დროს
