answer = []  # ვქმნით ლისთს სწორი პასუხებისთვის

for i in range(2,int(1e6)):     # ვამოწმებთ ყველა რიცხვს 2-დან მილიონამდე
    number_str = str(i)         # რიცხვებს ვწერთ სტრინგებად
    Temporary = []           # შემოგვაქ დროებითი პასუხების ლისთი სადაც ავჯამავ კონკრეტული რიცხვის თითოეული ციფრის ხარისხს
    for k in number_str:
        Temporary.append(int(k)**5)  # რიცხვის თითოეულ ციფრს ვახარისხებთ და ვამატებთ დროებთ ლისთში

    if i == sum(Temporary):      # თუ დროებითი ლისთის ჯამი დაემთხვევა თვითონ ამ რიცხვს მაშინ ამ რიცხვს ვამატებთ პასუხების ლისთში
        answer.append(i)


print(sum(answer))  # ვჯამავთ პასუხების ლისთის ყველა წევრს
