from math import factorial  # შემოგვყავს ფაქტროიალები
import time   #  შემოგვყავს ტაიმერი რათა დავითვალოთ გამოთვლაზე დახარჯული დრო

start = time.time()

answer = []  # ვქმნით ლისთს პასუხებისთვის

for i in range(3,100000):       # ვიღებთ გარკვეულ სიმრავლეს
    number = str(i)     # რიცხვები გადაგვყავს სტრინგებში
    
    dro = []        # ვქმნით დროებით ლისთს რათა მასში შევინახოთ გარკვეული რიცხვის, ციფრების ფაქტორიალები
    for digit in number:
        dro.append(factorial(int(digit)))   # ვიღებთ რომელიმე რიცხვის თითოეულ ციფრს, ვითვლით მის ფაქტორიალს და ვამატებთ დროებით ლისთში
    if sum(dro)==i:         # თუ დროებითი ლისთის ჯამი და საწყისი რიცხი ემთხვევა ერთმანეთს
        answer.append(i)    # მაშინ ამ რიცხვს ვამატებთ პასუხების ლისთში

print(sum(answer))      # ვკრიბავთ პასუხების ლისთს და ვპრინტავთ მას


end = time.time()
print(end-start)    # ვპრინტავთ გამოთვალზე დახარჯულ დროს