import time

start = time.time()

counter = 1   # შემოგვაქვს მთვლელი           1-ს იმიტომ ვუტოლებთ რომ 2 ფუნტიანის მაგალითი გამოვრიცხოთ


for i in range(3):          # მხოლოდ 0,1 ან 2   პუნტიანის აღება შეგვიძლია
    for j in range(int((200-i*100)/50)+1):  # 50 ცენტიანების რაოდენობა დამოკიდებული იქნება იმაზე თუ რამდენ 1 ფუნტიანს ავიღებთ
        for k in range(int((200-i*100-j*50)/20)+1):     # 20 ცენტანების რაოდენობა დამოკიდებული იქნება იმაზე თუ რამდენი 1 პენიანი და 50 ცენტიანი გვაქვს აღებული
            for s in range(int((200-i*100-j*50-k*20)/10)+1):        # ზემოთ ხსენებული ლოგიკა ვრცელდება ყველა ქვემოთ არსებულ კალკულაციაზე 
                for t in range(int((200-i*100-j*50-k*20-s*10)/5)+1):
                    for f in range(int((200-i*100-j*50-k*20-s*10-t*5)/2)+1):
                        for y in range(int((200-i*100-j*50-k*20-s*10-t*5-f*2))+1):      # ამ ფუქნციას არ ვიყენებთ რადგან 1-ცენტიანებს ავტომატურად ითვლის
                            continue        # უბრალოდ ვიყენებთ იმაში რომ ვინმემ შედდეგების დაპრინტვის დროს ყველა კომბინაცია თვალნათლივ ნახოს
                        counter += 1        # საბოლოოდ აქ ვიღებთ ყველა შესაძლო კომბინაციას რომლითაც მივიღებთ 200 ცენტს

                        #print(str(i) + "*(1£)  ",str(j)+ "*(50p)  ",str(k)+ "*(20p)  ",str(s)+ "*(10p)  ",str(t)+ "*(5p)  ",str(f) + "*(2p)  ",str(y) + "*(1p)")
                        # მეტი თვალსაჩინოებისთვის შეგვიძლია დავპრინტოთ ყველა კომბინაცია რომ დავრწმუნდეთ მის სისწორეში

print(counter)


print("Calculation time:" , time.time() -start)     # ვპრინტავთ გამოთვალზე დახარჯულ დროს