import time   #  შემოგვყავს ტაიმერი რათა დავითვალოთ გამოთვლაზე დახარჯული დრო
start = time.time()

goal = 1000

A = [int(i) for i in range(1,goal+1)]   # ვქმნით რიცხვთა სიმრავლეს რათა გადაავმოწმოთ ყველა შესაძლო კომბინაცია
B = [int(i) for i in range(1,goal+1)]   # ვქმნით რიცხვთა სიმრავლეს რათა გადაავმოწმოთ ყველა შესაძლო კომბინაცია



for a in A:     # პირველი სიმრავლიდან ვიღებთ ელემენტს
    for b in B:     # მეორე სიმრავლიდან ვირებთ ელემენტს
        c = goal - a - b    # მესამე სიმრავლე პირობის თნახამად არის c + a + b = 1000
        if (a*a) + (b*b)== (c*c) and a<b and b<c:   # ვადებთ საჭირო შეზღუდვებს 
            print(str(a*b*c))    # ვბეჭდავთ პასუხს
            
    

print("Calculation time:" , time.time() -start)     # ვპრინტავთ გამოთვალზე დახარჯულ დროს