import string
import time   #  შემოგვყავს ტაიმერი რათა დავითვალოთ გამოთვლაზე დახარჯული დრო
start = time.time()


f = open('Data/Project Euler/Problem_42.txt', 'r')   # შემოგვყავს ფაილი

content = f.read()  # ფაილის ელემენტს ვინახავთ რაიმე ცვლადში

content= content.split(",")  # რადგან პროგრამა ყველა ელემენტს ერთ ელემენტად აღიქვამს ამიტომ ამ ერთ ელემენტს ვყოფთ ელემენტაბათ ","-ის მეშვეობით


Alphabet = list(string.ascii_uppercase)     # შემოგვყავს ანბანის ლისთი


triangle_numbers = [int((i/2)*(i+1)) for i in range(1,50)]  # ლისთსი ვინახავთ ყველა triangle- რიცხვს


counter = 0         # შემოგვყვავს მთველელი

for name in content:       # ვიღებთ თითოეული ელემენტის ინდექს
    value = 0           # ვქმნით ცვლადს თითოეული სახელის ქულის დასადგენად, ყველა ახალი სახელის შემოსვლისა ეს ნულდება 
    for i in name:      # ვიღებთ ასოებს სიტყვებიდან
        index = Alphabet.index(i) + 1       # ვამოწმებთ ამ ასოების რიგითობას, რადგან ლისთის პირველი წევრი 0-ა ამირომ თანრიგის გასწორების მიზნით ვამატებთ 1-ს 
        value += index      # თითოეული ასოს ადგილმდებარეობის აღმნიშვნელ რიცხვს ვკრიბავთ რათა სიტყვის ქულა გამოვთვალოთ

    if value in  triangle_numbers:     # თუ მუღბული ქულა იქნება triangle-რიცხვების ლისთში მაშინ ეს სიტყვაც triangle word-ია და ამიტომ მთვლელს ვამატებთ 1-ს
        counter += 1       


print(counter) # ვპრინტავთ პასუხს

print("Calculation time:" , time.time() -start)     # ვპრინტავთ გამოთვალზე დახარჯულ დროს
